# Machine Learning Course - Day 7

In [3]:
import pandas as pd

arreglo = [1,2,3,4,5,6,7,8]

In [4]:
serie = pd.Series(arreglo)

In [5]:
type(serie)

pandas.core.series.Series

In [6]:
serie

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [7]:
valor_dolar = [20.1, 20.4, 20.5]
dolar = pd.Series(valor_dolar, index=['Lunes', 'Martes', 'Miercoles'])

In [8]:
dolar['Lunes']

20.1

Como acceder a un dataset en nuestra misma ubicacion?

In [12]:
pf = pd.read_csv("toy_dataset.csv")
pf

        Number    City  Gender  Age    Income Illness
0            1  Dallas    Male   41   40367.0      No
1            2  Dallas    Male   54   45084.0      No
2            3  Dallas    Male   42   52483.0      No
3            4  Dallas    Male   40   40941.0      No
4            5  Dallas    Male   46   50289.0      No
...        ...     ...     ...  ...       ...     ...
149995  149996  Austin    Male   48   93669.0      No
149996  149997  Austin    Male   25   96748.0      No
149997  149998  Austin    Male   26  111885.0      No
149998  149999  Austin    Male   25  111878.0      No
149999  150000  Austin  Female   37   87251.0      No

[150000 rows x 6 columns]

In [16]:
pf.loc[5000]

Number        5001
City        Dallas
Gender      Female
Age             48
Income     48549.0
Illness         No
Name: 5000, dtype: object

In [17]:
pf.tail()

        Number    City  Gender  Age    Income Illness
149995  149996  Austin    Male   48   93669.0      No
149996  149997  Austin    Male   25   96748.0      No
149997  149998  Austin    Male   26  111885.0      No
149998  149999  Austin    Male   25  111878.0      No
149999  150000  Austin  Female   37   87251.0      No

In [18]:
pf.head()

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No